System-Design/Concepts/Containers/Kubernets/Terms/istio/README.adoc
```mermaid
flowchart TB

    subgraph POD1
       subgraph container_b
            istio_sidecar1
        end
        subgraph container_a
            microservice1
        end
    end

    subgraph POD2
        subgraph container_c
            microservice2
        end
        subgraph container_d
            istio_sidecar2
        end
    end

    container_a <--"HTTP"--> container_b
    container_c <--"HTTP"--> container_d
    container_d <--"HTTPS"--> container_b
```
